Revit 2027 API
RegenerationAttribute Constructor
Constructs a new RegenerationAttribute.
Namespace: Autodesk.Revit.Attributes
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RegenerationAttribute(
	RegenerationOption option
)
Public Sub New (
	option As RegenerationOption
)
public:
RegenerationAttribute(
	RegenerationOption option
)
new :
        option : RegenerationOption -> RegenerationAttribute
Parameters
option RegenerationOption
See Also
Reference
RegenerationAttribute Class
Autodesk.Revit.Attributes Namespace